INSERT INTO books (title, author, year, genre, is_available) 
VALUES
('Мастер и Маргарита', 'Михаил Булгаков', 1967, 'Роман', true),
('Преступление и наказание', 'Федор Достоевский', 1866, 'Роман', false),
('1984', 'Джордж Оруэлл', 1949, 'Антиутопия', true),
('Гарри Поттер и философский камень', 'Джоан Роулинг', 1997, 'Фэнтези', true),
('Пикник на обочине', 'Аркадий и Борис Стругацкие', 1972, 'Фантастика', false),
('Убийство в Восточном экспрессе', 'Агата Кристи', 1934, 'Детектив', true),
('Маленький принц', 'Антуан де Сент-Экзюпери', 1943, DEFAULT, true),
('Сказки народов мира', DEFAULT, DEFAULT, 'Сказки', true),
('Евгений Онегин', 'Александр Пушкин', 1833, 'Поэзия', true),
('Война и мир', 'Лев Толстой', 1869, 'Роман', false),
('Дюна', 'Фрэнк Херберт', 1965, 'Фантастика', DEFAULT),
('Записки неизвестного автора', NULL, NULL, DEFAULT, DEFAULT);

select * from books;
select * from books where year >= 1965;

UPDATE books SET is_available = false 
WHERE  author = 'Антуан де Сент-Экзюпери';

delete from books where genre = 'Не указан';
select * from books;